# -*- coding: utf-8 -*-
"""
Created on Sat Dec 25 16:22:00 2021

@author: nnk
"""

vsum = 1
vsum

v1 = 'abcd'
v1

round(1.5)

import math
import math as ma
ma.trunc(1.5)

# =============================================================================
# ctrl+4
# =============================================================================

from math import trunc
trunc(1.5)

3+2
3 / 1.5
10-2
5*3

9//2
9 % 2
3**2

math.pow(3, 2)  # 거듭제곱 pow

# =============================================================================
# 리스트 []  a = [1,2,3,4]
# =============================================================================

l1 = [1, 2, 3, 4]
l1
type(l1) # list
l2 = [1, 2, 3, '4']
type(l2) # list

t1 = (1, 2, 3, 4)
type(t1) # tuple
t2 = 1,2,3,4

l1 # [1, 2, 3, 4]
l1[0]
l1[-1]
l1[-2]
l1[0:1]
l1[0:2]

l1[0,2] # x
l2[0,2] # x
# l2[[0:2]] # x

l1[0] = 10
l1 #[10, 2, 3, 4]

l1 + 1
l1 > 1
l1 + '1'
l1 + [2]

[1,2,3] + [10,20,30]
l1 + [5]        # 단순히 한번 넣어봄,
l1 # [10, 2, 3, 4]
l1.append(6)    # l1이 다시 됨
# [10, 2, 3, 4, 6]
l1 = l1 +[5]    # 새 변수로 넣어줘야 됨
# [10, 2, 3, 4, 6, 5]
l1 # [10, 2, 3, 4, 6, 5]

'a' + 'b'
'a'*3

t1
t1[0] = 10
# TypeError: 'tuple' object does not support item assignment

## 객체 내 원소 1개 삭제
del(l1[0])
l1
# [2, 3, 4, 1, 6, 5]
## 객체 삭제
del(l1)
l1
# NameError: name 'l1' is not defined

# 객체 내 모든 원소 삭제
l2 # [1, 2, 3, '4']
l2 = []
l2 # []


## 함수 : 인수전달은 괄호 안에서 진행됨
sum([1,2,3])
# 6
lsum = sum([1,2,3])

l3 = [1,2,3]
sum(l3)

## 메서드 : 객체에서 호출 가능, 함수, 값은 객체가 가짐
import numpy as np
a1 = np.array([1,2,3])
a1 # array([1, 2, 3])
a1sum = a1.sum()
# 6