# -*- coding: utf-8 -*-
"""
Created on Sat Dec 25 20:53:49 2021

@author: nnk
"""

# =============================================================================
# 논리연산자
# and : 곱하기
# or : 더하기
# not : 부정
# =============================================================================

v1 = 1
(v1 >= 3) and (v1 <= 7)  # False
(v1 >= 3) & (v1 <= 7)  # False

(v1 <= 3) or (v1 >= 7)  # True
(v1 <= 3) | (v1 >= 7)  # True

not(v1 == 1)  # False


# =============================================================================
# 형식
# if 조건:
#     True 실행문
# else:
#     False 실행문

# if 조건1:
#     조건1 True 실행문
# elif 조건2:
#     조건1 False & 조건2 True 실행문
# else:
#     조건1, 2 False 실행문
# =============================================================================

v2 = 4
if v2 > 5:
    print('A')
else:
    print('B')
# B

v3 = [1, 3, 5, 7, 9]
if v3 > 5:
    print('A')
else:
    print('B')
# TypeError: '>' not supported between instances of 'list' and 'int'

# =============================================================================
# for 반복할 변수 in 반복할 대상(범위):
#     반복 실행문
# =============================================================================

for i in range(1,11):
    print(i)

l1 = [1,3,5,15,25]
for i in l1:
    if i >5:
        print('A')
    else:
        print('B')
# B
# B
# B
# A
# A

# =============================================================================
# 리스트에서 각 원소에 10을 더해서 출력
# =============================================================================

l1 = [1,3,5,15,25]
l1 + 10
# TypeError: can only concatenate list (not "int") to list
# l1 = for i in l1
#     print(i+10)
# SyntaxError: invalid syntax : 효력없는 구문론

l2 = []
for i in l1:
    l2.append(i+10)

print(l2)
# [11, 13, 15, 25, 35]

l3 = [1,2,3]
l3.append(4)

l3 # [1, 2, 3, 4]

[1,2,3].append(4) # 저장 필요


# =============================================================================
# while 조건:
#     True 실행문
# =============================================================================

i=1
while i <= 10:
    print(i)
# 1이 무한반복되는 식

i=1
while i <=10:
    print(i)
    i+=1
# 1 2 3 4 5 6 7 8 9 10
# while 자체에 조건을 걸어주자!

i=0
while True:
   if i <= 9:
       print(i+1)
       i+=1
   else:
       break
# 연습! while True: 는 조심! break 없으면 정신못차림

# 내 답=========================================================================
esum = 0
e=1
while e<=11:
    esum+=e
# TypeError: 'int' object is not iterable
# e(int) 자체는 반복 불가! 반복할 수 있게 도와주자 !!

esum = 0
e=1
while e<=11:
    esum+=e
    e+=1
# 66 
# =============================================================================

vsum = 0
for i in range(1,101):
    vsum = vsum + i
print(vsum)
# 5050

vvsum = sum(i for i in range(1,101))
print(vvsum)
# 5050
# 함수의 객체화

sl3 = sum(l3)

# =============================================================================
# 1~100까지 짝수 총합
# 힌트
# if i%2 == 0: 만약 i를 2로 나누어서 나온 나머지가 0이면 --> 짝수
# if i%2 == 1: 만약 i를 2로 나누어서 나온 나머지가 1이면 --> 홀수 
# =============================================================================

vdsum = 0
for i in range(1,101):
    if i%2 == 0:
        vdsum += i
    # else:
    #     continue
print(vdsum)
# 2550

# =============================================================================
# 반복제어문
# 1. continue : 특정 조건일 경우 반복문 스킵
# 2. break : 특정 조건일 경우 반복문 종료 (정지조건)
# 3. exit : 특정 조건일 경우 프로그램 종료 - exit(0) 0 필수
# 4. pass : (협업할 때 많이 씀) 문법적으로 오류가 발생시키지 않기 위해 자리를 채우는 역할
# =============================================================================

# =============================================================================
# 1~10 출력, 5제외
# =============================================================================

for i in range(1,11):
    if i == 5:
        continue
    print(i)

for i in range(1,11):
    if i == 5:
        break
    print(i)
    
# =============================================================================
# 문제
# 1부터 100까지 누적합이 최초 2000이 되는 시점의 k 값과 총합을 출력하세요.
# 1 + 2 + 3 + ... + k >= 2000
# =============================================================================

# 내답=========================================================================
Vsum = 0
for k in range(1,101):
    if Vsum>=2000:
        print(k, Vsum)
        break
    else:
        Vsum += k
# 64 2016 --> 틀림!!
# =============================================================================

Vsum1 = 0
for k in range(1,101):
    Vsum1 += k
    if Vsum1 >= 2000:
        break
print(k, Vsum1)
# 63 2016

a = 0
for i in range(1,101):
    a = a + i
    if a>2000:
        print(i)
        break
print(a)
# 63 2016

vsum = 0
for i in range(1,101):
    vsum = vsum + i
    if vsum >= 2000:
        break
print(i, vsum)
# 63 2016